{'status': 'success', 'totalResults': 137, 'results': [
        {'title': "'Ahsoka' vs.
'Rebels': 4 Huge Canon Changes in the New Star Wars Show", 'link': 'https://www.inverse.com/entertainment/ahsoka-vs-rebels-star-wars-canon-changes', 'keywords': ['Streaming', 'Star Wars', 'Disney', 'TV Shows', 'Science Fiction', 'Disney
Plus', 'Entertainment', 'Ahsoka', 'homepage', 'TV'
        ], 'creator': ['Lyvie Scott'
        ], 'video_url': None, 'description': "10 years have passed since the 'Star Wars
Rebels' finale and a lot has changed for our heroes when they show up in 'Ahsoka.' If your confused, we've got you covered.", 'content': 'Wait, what happened
to Thrawn again? It’s been 10 long years since the Spectres stood united against Grand Admiral Thrawn in the series finale of . And while seems to pick up the story of that rebel cell pretty seamlessly, a lot has changed both in the Star Wars galaxy and in our own reality. So if you’re not familiar with , you might just be a little confused. But if you’re a huge fan, there’s a chance you’ll be even more confused! A lot of that is due to the 10-year time jump between and , but it also seems like Lucasfilm may be taking some liberties with the animated show’s ending. So if you’re wondering what’s actually changed in Star Wars
canon we’ve got you covered. Here are four things revealed in that definitely didn’t happen in . 4. Thrawn was pronounced dead after the Battle of Lothal Thrawn is back from his exile in . While Grand Admiral Thrawn has been missing from the galaxy for a decade, the details of his disappearance apparently aren’t public knowledge. At the end of , we watched as Thrawn and Ezra Bridger were transported to during the Battle of Lothal. He’s been in exile ever since, but some former rebels seem to have gotten a conflicting story. Ahsoka locates a map that allegedly contains Thrawn’s last known location, something that surprises her old friend Hera Syndulla. Hera was under the impression that Thrawn was murdered during the Battle of Lothal — which doesn’t really make sense, since she was there to witness his fleet make the jump into hyperspace. Is Hera in denial?
Sure, we tell ourselves all sorts of things to make sense of the past, but Thrawn is definitely still out there. In her heart, she must realize the New Republic will have to deal with him eventually. 3. Ezra and Sabine were more like brother and sister After 10 years, Sabine’s ready to search for Ezra again. Depending on who you ask, this isn’t exactly a change. Ezra’s relationship to Sabine
has always been a matter of perception. While they weren’t exactly simpatico when they first met in , their harrowing missions together saw them growing closer over the years. Some look at Ezra and Sabine and see romance. Others see a sibling bond. , fortunately, lays it out in the plainest terms possible: Ezra’s always seen Sabine as a sister. Whether Sabine feels the same way remains to be
seen, but their bond is pretty strong regardless. Sabine still hasn’t given up
on Ezra, and she still believes he can be rescued. It’s the main reason she decides to team up with Ahsoka again in spite of their prickly past. Speaking of which... 3. Sabine is now Ahsoka’s apprentice That brings us to s next canon change (and one of its biggest). A lot of time has passed since we last saw Sabine in action, and in that time, she was apparently an apprentice of Ahsoka (for a very brief stint). While this isn’t entirely out of the ordinary, it is a weird progression for her character. Ezra passed his lightsaber onto Sabine shortly before his disappearance, and Sabine herself is no stranger to energy weapons. Before Din Djarin got his hands on the Darksaber, it was once Sabine’s, and she trained briefly with it during . But that was with a Jedi named Kanan Jarrus, not Ahsoka. Maybe Ahsoka saw that potential in Sabine and wanted to hone it further. Maybe Sabine just wanted to develop her skills as a swordswoman. Given all the talk about Force sensitivity, however, it’s more likely that Ahsoka was
looking for a padawan. 1. Ahsoka might be a Jedi again Ahsoka will fast her greatest challenge yet. Much has been made of Ahsoka’s current feelings about the
Jedi. She famously walked away from the order before her training was complete
in , and she doesn’t seem to anymore. She’s definitely playing fast and loose with the Jedi Code, especially where Sabine is concerned. Only Jedi or Sith are
known to take padawans so could see the ex-Jedi reconciling her shaky past with a forgotten dogma. is all about the strained bonds between masters and apprentices. This journey to defeat Thrawn will bring Ahsoka face to face with her failings, partnership with Sabine included. While Sabine may not be anyone’s first choice for a padawan, it’s clear they both need each other to let go of the past. Perhaps together, they’ll forge a new way forward for the Jedi. Stranger things have certainly happened.', 'pubDate': '2023-08-23 09: 00: 25', 'image_url':
'https: //imgix.bustle.com/uploads/image/2023/8/22/8a8b27b1-2ced-4679-9a41-6e277e3900da-ahsoka-smile.jpg?w=500&fit=max&auto=format%2Ccompress', 'source_id': 'inverse', 'source_priority': 1679, 'country': ['united states of america'], 'category': ['top'], 'language': 'english'}, {'title': 'Bengaluru’s Jain Varsity to See Drama Over ‘Deemed to be’ Tag After Skit ‘Insulting Ambedkar, Dalits’?', 'link': 'https://www.news18.com/india/bengalurus-jain-varsity-to-see-more-drama-over-deemed-to-be-tag-after-skit-insulting-ambedkar-dalits-8546826.html', 'keywords': ['latest'], 'creator': None, 'video_url': None, 'description': 'Bengaluru’s Jain varsity saw row over skit \'insulting Ambedkar, Dalits\': Karnataka government has written to the Centre seeking withdrawal of the ‘deemed-to-be’ tag. Prof M S Santhosh, Joint Registrar, said “they have no communication from the state, but the skit was not done with their knowledge"', 'content': 'The Karnataka government has written to the Centre seeking withdrawal of the ‘deemed-to-be university’ notification tag of Bengaluru’s Jain University, which witnessed a row in February over a skit with derogatory terms against Dr Babasaheb Ambedkar and Dalits during a college festival. In the first-ever reaction, Prof M S
Santhosh, Joint Registrar at the University, told News18 exclusively that “they have no communication from the state government to this effect, but the skit was not done with their knowledge". ALSO READ | 2 FIRs & 50 Complaints: Bengaluru College Faces Protests Over Skit ‘Insulting Ambedkar, Dalits’ The state government’s committee formed to investigate the matter found that “the management of the University was well aware of the script, content and dialogues”. “In spite of that, the management of the University did not prevent the student from performing the said skit,” stated the letter to the Secretary of the Union Ministry of Education. The letter dated August 8 highlighted that the skit used words such as ‘untouchability’, ‘inequality’, ‘caste’, and ‘reservation’ in a contemptuous manner. “This incident caused unrest in society and hurt the sentiments
of the public,
        " the letter further emphasised. The recommendation from Karnataka is signed by Nandakumar B, the under-secretary of the higher education department, and underlines that the Centre should take immediate measures to withdraw the notification declaring Jain University as an institution deemed to be a university. “The apparent maladministration and mismanagement of the University constrained the state government to invoke coercive measures against the university. Accordingly, I am directed to request you to withdraw the notification declaring Jain University as an Institution deemed to be a University at the earliest," the letter said. Prof M S Santhosh said, “We have no communication from the state government to this effect. We have written to the state government asking them about their communication to the Central government, if there is one.
We are seeking details of the letter if any, and we want it to be shared with us. We have not been kept in the loop of the communication of this particular report, nor have we received a copy of it.” Santhosh further stated that it has come to their knowledge that “the skit was done with our full knowledge". “We would like to clarify that this is not true. It was not well within our knowledge. The alleged communication talks about mismanagement and maladministration. I
sincerely don’t know what they are talking about, and we are awaiting an official copy of this letter and the report. We would like to know what the inference has been on this issue," the Prof added. Jain University, a Bengaluru-based private university that was initially operating as Sri Bhagawan Mahaveer Jain College, has five campuses in the IT capital and a student strength of over 30,000. It attained the ‘deemed-to-be university’ tag in 2009. On February 11, students participating in the extended youth festival scheduled until February 20 performed a skit that allegedly contained derogatory references to Dr B R Ambedkar and Dalits. The skit contained dialogues that were considered offensive and contained derogatory remarks against the community and the Father of the Indian Constitution. As the video went viral, there was outrage in the state, especially among Dalit organisations. The Bengaluru police arrested nine people, including seven students and two faculty members, who were part of the performance. The nine accused faced charges under Indian Penal Code (IPC) Sections 153A, 295A, and 149 for offences related to instigating animosity between societal groups. They were later remanded in police custody for three days and were granted bail after spending 10 days in custody. Dalit organizations staged protests, with
more than 50 formal complaints and two first information reports (FIR) lodged in Nanded and Bengaluru by members of the Bahujan Samaj Party (BSP). ALSO REAAD
| Jain University Students Mock Ambedkar in ‘Casteist’ Skit, Viral Video Sparks Outrage The skit was presented by The Delroys Boys, a theatre group from the CMS unit of the university. They later issued an unconditional apology along with the management. A university official, who spoke to News18 when the issue broke out in February, had said that “the skit was categorized under a segment called Mad-Ads, where participants are to advertise imaginary products with humorous content. It was intended to be spontaneous”. “While its purpose was to highlight the societal challenges linked to the caste system, the seven students took liberties that crossed the line,” the college authorities had said. The apology letter said “the skit aimed to highlight anti-caste sentiments but had crossed boundaries while being presented extempore". The university also outlined that the skit’s intention was “to highlight the issues associated with the caste
system in the country".', 'pubDate': '2023-08-23 08:49:49', 'image_url': 'https://images.news18.com/ibnlive/uploads/2023/08/bengaluru-jain-varsity-skit-insulting-ambedkar-dalits-3-16927803713x2.jpg', 'source_id': 'news18', 'source_priority': 6644, 'country': ['india'], 'category': ['top'], 'language': 'english'}, {'title': 'AD Ports Group’s Economic Cities & Free Zones and Digital Cluster Enhances Customer Experience', 'link': 'https://uaenews247.com/2023/08/23/ad-ports-groups-economic-cities-free-zones-and-digital-cluster-enhances-customer-experience/', 'keywords': ['Business & Investments', 'AD Ports Group’s'], 'creator':['uaenews247'
    ], 'video_url': None, 'description': 'AD Ports Group’s Economic Cities & Free Zones and Digital Cluster Enhances Customer Experience Numerous Initiatives completed under the Abu Dhabi Programme for Effortless Customer Experience at KEZAD Abu Dhabi,
    23 August,
    2023: AD Ports Group (ADX: ADPORTS), the leading facilitator of global trade, logistics and industry has completed a number of initiatives under The … Continue reading AD Ports Group’s Economic Cities
& Free Zones and Digital Cluster Enhances Customer Experience →', 'content': 'Numerous Initiatives completed under the Abu Dhabi Programme for Effortless Customer Experience at KEZAD AD Ports Group (ADX: ADPORTS), the leading facilitator of global trade, logistics and industry has completed a number of initiatives
under The Abu Dhabi Program for Effortless Customer Experience, a pioneering new model that enables effortless customer experiences across Abu Dhabi Government and positions the emirate as a leader in the field. Spearheaded by the Group’s Economic Cities & Free Zones and Digital clusters, the initiatives were aimed at enhancing the omnichannel experience for clients at KEZAD. From improved service level agreements for walk-ins and contact centre enquiries to the launch
of a digitalised Free Zone License application service through the Advanced Trade & Logistics Platform (ATLP), the initiatives included innovative approaches
to making the flow of information more user friendly while enabling centralised access through KEZAD Cloud for investor-related documents to all key government stakeholders and partners, for quick turnaround. Another key service improvement, the Customs Registration Number integration, provides the investor with an importer code immediately with the issuance of a license. The new service operating procedures allow investors to avail the license application service through UAE Pass application as well. All initiatives were aligned with the Effortless Customer Experience Programme model’s four dimensions of direction, design,
development and delivery, spanning from digitisation of services and systems’ integration to mapping stakeholder delegations for several relevant government entities, regular customer communication and comprehensive training for customer support functions. The customer-focused approach resulted in completely transforming the investor registration process, cutting down the number of touchpoints required, offering a Single Window for free zone license application and post-licensing services for KEZAD; in addition to building a state-of-the-art investor dashboard that unifies information from all relevant entities, facilitating Foreign Direct Investment through overseas registrations on ATLP and more. Abu Dhabi is firmly committed to continuously improving business ecosystem as part of ongoing efforts to enhance the emirate’s position as preferred destination
for talent, business, and investment. As catalyst for economic growth and diversification, ADDED has been rolling out initiatives to enhance customer and stakeholder experiences in the trade and logistics sectors. We believe the efforts
made by AD Ports Group to enhance customer experiences are valuable addition to our trade facilitation solutions by simplifying procedures, reducing time and
cost, and enhancing seamless integration of government services”. “Customer Service is, and has always been one of the key differentiators at AD Ports Group and specifically KEZAD Group. We welcome initiatives like the Abu Dhabi Program
for Effortless Customer Experience brings key organisations within the greater
Abu Dhabi business ecosystem to work together to enhance this experience even further. “Our Programmes like KEZAD Connect, Josoor, Tawasul are key initiatives that maintain our dialogue with our customers through in person and digital means, making us deliver on our promise of being available to our clients to listen, support and deliver exceptional experiences,” he added. At the Digital Cluster and AD Ports Group, we understand the importance of effortless omnichannel
experiences and its impact on customer happiness. It has been our constant endeavor to accelerate the wise leadership’s vision of delivering world-class, effortless customer experiences for all interactions with the government. “The Cluster’s technological developments geared towards transforming the trade and logistics industry follow design thinking approach. We are constantly monitoring direct and indirect feedback from customers, partners and stakeholders to reduce
friction. The Effortless Customer Experience Programme has been instrumental in taking our efforts to the next level in the development and operations of ATLP, under the supervision of the Abu Dhabi Department of Economic Development.” The Advanced Trade & Logistics Platform (ATLP), developed and operated by Maqta
Gateway under the supervision of the Abu Dhabi Economic Development (ADDED), serves as Abu Dhabi’s Single Window for trade and offers 700+ services to the trade community in Abu Dhabi and beyond. With the recent launch of digitalised Free Zone Application service through ATLP, customers can easily lease land, warehouse, or showrooms and even flexi-desk space at KEZAD remotely. The Abu Dhabi Program for Effortless Customer Experience model addresses the entire customer experience holistically, is benchmarked against international standards and will see major investment in human capital through a government-wide effortless customer experience training programme. – ENDS –', 'pubDate': '2023-08-23 08: 38: 24', 'image_url': 'https: //2.gravatar.com/avatar/8cf576a7747fe7b37bd632f279fa3bc8f461c8fabecbc279bd79160e7a06a7bc?s=96&d=identicon&r=G', 'source_id': 'uaenews247', 'source_priority': 7518978, 'country': ['united arab emirates'], 'category': ['business'], 'language': 'english'}, {'title': "'People Should be Careful, I'm Recovering from Cancer': Heath Streak Reacts After Rumours of His Death Go Viral", 'link': 'https://www.news18.com/cricketnext/heath-streak-reaction-death-hoax-recovering-cancer-rumours-fake-news-better-health-zimbabwe-cricket-8546915.html', 'keywords': ['latest'], 'creator': None, 'video_url': None, 'description': "Heath Streak says treatment for the cancer has taken its toll on him but otherwise he's doing fine.", 'content': 'Zimbabwe legend Heath Streak says he’s
fine and recovering from cancer, shutting down rumours around his death that surfaced on social media and elsewhere on Wednesday morning. Zimbabwe captain Sean Williams and former fast bowler Henry Olonga posted on X (formerly known as Twitter) claiming Streak has passed away as they paid tributes. Soon the news spread like wildfire with several current and former cricketers offering condolences. However, Streak’s daughter dismissed the claims, saying his father is alive while Olonga also offered a clarification with an apology. Streak,
    49, has expressed his disappointment at the development, asking people to be careful before ‘spreading such rumours’. “People should be a bit more careful before spreading such rumours. I am better now and recovering from cancer,” Streak was quoted as saying by Sportstar . Streak is suffering from colon and liver cancer (Stage 4) but says he’s doing better now. “I am at home and obviously there’s still a bit of strain because of the treatment. But otherwise I am fine. Suddenly I
get to know that people have started talking about my death, as someone shared
it on social media. But that was not all correct. I am recovering and feeling a lot better…," he said. Streak is widely regarded as one of Zimbabwe’s finest cricketers who played 65 Tests and 189 ODIs during his international career. He’s their all-time leading wicket-taker in Test cricket with 216 victims and also remains the only Zimbabwean to take 100 wickets in the format. He took 239 wickets in ODIs which is also the most by any from his country. With the bat, Streak managed 1990 runs in Tests while 2943 runs in ODIs. He scored one century and 24 half-centuries during his Zimbabwe career. Post retirement, Streak dabbled in coaching and was associated with Zimbabwe, Bangladesh, Kolkata Knight Riders and Gujarat Lions. In 2021, he was received an eight-year ban from all cricket after being found guilty of breaching ICC Anti-Corruption Code. Streak accepted five charges while denying he was ever involved in match fixing.', 'pubDate': '2023-08-23 06:45:10', 'image_url': 'https://images.news18.com/ibnlive/uploads/2023/08/heath-streak-afp-1-16927729793x2.jpg', 'source_id': 'news18', 'source_priority': 6644, 'country': ['india'], 'category': ['top'], 'language': 'english'}, {'title': 'Three Ways To Get Rid Of Land Encroachment And Guard Your Property', 'link': 'https://www.news18.com/business/three-ways-to-get-rid-of-land-encroachment-and-guard-your-property-8546929.html', 'keywords': ['latest'], 'creator': None, 'video_url': None, 'description': 'Often our neighbours practice illegal activities by constructing their homes in such a way that it creates problems on your land as well.', 'content': 'Land encroachment, the unlawful act of occupying or utilising property without legal rights or permission, has become a pressing issue in India, particularly affecting abandoned agricultural lands and unused residential spaces. This phenomenon often leads to disputes and raises questions about property rights and boundaries. Encroachments not only involve physical occupation but also encompass instances where activities infringe upon neighbouring lands, such as unauthorized construction extensions or encroaching on balconies and roofs. Addressing these concerns necessitates a multifaceted approach that blends negotiation, legal channels, and administrative intervention. In India, penalties for land encroachment are stipulated under Section 447 of the Indian Penal Code. Encroachments can disrupt harmony and raise property value concerns, compelling individuals to seek resolution. The initial recourse lies in amicable communication with neighbours to seek mutual consent and resolve the matter outside of the legal framework. When this approach falters, legal avenues come into play. One recourse involves appealing to the Sub Divisional Magistrate (SDM) of the district. SDMs hold Lok Adalats to address land
and property disputes. The importance of carrying proper property documents and photographic evidence of encroachment cannot be understated. A convincing presentation before the SDM can initiate an investigation into the matter. Alternatively, approaching the local municipality office can help. Each construction site has a corresponding map detailing boundaries set by the government or state
authorities. When these boundaries are breached, the case qualifies as land encroachment. Presenting this map as evidence both at the local municipality office and the SDM office bolsters the case. If dissatisfaction persists with these
administrative procedures, seeking judicial intervention becomes an option. Initiating legal proceedings by submitting applications to a judge, along with property documents and evidence of encroachment, can escalate the matter. Court intervention can not only help resolve the issue but also establish legal precedents for addressing future encroachments.', 'pubDate': '2023-08-23 06: 42: 57', 'image_url': 'https: //images.news18.com/ibnlive/uploads/2023/08/untitled-design-2023-08-23t121136.206-16927729243x2.jpg', 'source_id': 'news18', 'source_priority': 6644, 'country': ['india'], 'category': ['top'], 'language': 'english'}, {'title': 'Job Scam Horror: Mumbai Woman Duped Of Rs 17 Lakh In Online Job Offer
Fraud, Know Details', 'link': 'https: //www.news18.com/business/online-job-fraud-cyber-crime-mumbai-8546829.html', 'keywords': ['latest'], 'creator': None, 'video_url': None, 'description': 'Job scam: The woman approached the cyber police station in Navi Mumbai on Monday and filed a complaint.', 'content': 'Job scam: A 33-year-old woman from Navi Mumbai has allegedly lost Rs 17 lakh after being lured by fraudsters with an online job offer. The woman approached the cyber
police station in Navi Mumbai on Monday and filed a complaint. Two unidentified persons contacted the victim, from Kamothe area in Navi Mumbai, via Telegram app and offered her an online reviewing task on a website for which she was promised lucrative returns, an official from the Cyber police station told news agency PTI . Also Read: ATM PIN Scam Alert! What Is ‘Shoulder Surfing’? Here’s How To Protect Debit Card PIN For the job offered, the persons allegedly took Rs 17,
    00,
    629 from her between August 9 and 14,
    2023, he said. After completing the
task, when the victim sought payment of her earnings and the money which she had given to them, the persons gave her evasive replies and later became unreachable, the official said. Also Read: Lost Your SBI Debit Card? Here’s How To Block Card Instantly Online Or Via SMS The police have registered an FIR against two unidentified persons under sections 420 (cheating) and 34 (acts done by several persons in furtherance of common intention) of the Indian Penal Code and provisions of the Information Technology Act. (With PTI inputs)', 'pubDate': '2023-08-23 06: 17: 13', 'image_url': 'https: //images.news18.com/ibnlive/uploads/2023/08/scam-16925316883x2.jpg', 'source_id': 'news18', 'source_priority': 6644, 'country': ['india'], 'category': ['top'], 'language': 'english'}, {'title': 'FBISE HSSC Part 2 Result 2023 – Check Federal Board Inter Results here', 'link': 'https://en.dailypakistan.com.pk/23-Aug-2023/fbise-hssc-part-2-result-2023-check-federal-board-inter-results-here', 'keywords': ['Pakistan'], 'creator': ['Web Desk'], 'video_url': None, 'description': 'LAHORE – The Federal Board of Intermediate and Secondary Education FBISE has announced the results of HSSC-I and II
exams 2023 today (Wednesday).', 'content': 'LAHORE – The Federal Board of Intermediate and Secondary Education FBISE has announced the results of HSSC-I and II exams 2023 today (Wednesday). The Higher Secondary School Certificate candidates can check the results here at The results will be available on the FBISE website and will also be available through SMS unified code 5050. The candidates
will be required to send SMS in the following format; FB(roll number). The federal board made the announcement on its social media platforms, stating that the results will be available to students at 10: 30 am. It said Federal Minister for Education & Professional Training Madad Ali Sindhi will be chief guest at the ceremony regarding the announcement of the results.', 'pubDate': '2023-08-23 06: 15: 14', 'image_url': 'https: //en.dailypakistan.com.pk/digital_images/large/2023-08-23/fbise-hssc-part-2-result-2023-check-federal-board-inter-results-here-1692764288-7891.jpg', 'source_id': 'dailypakistanen', 'source_priority': 97265,
'country': ['pakistan'
    ], 'category': ['top'
    ], 'language': 'english'
},
{'title': 'FBISE HSSC Part 1 Result – Check Federal Board Inter Results 2023 here', 'link': 'https: //en.dailypakistan.com.pk/23-Aug-2023/fbise-hssc-part-1-result-check-federal-board-inter-results-2023-here', 'keywords': ['Pakistan'], 'creator': ['Web Desk'], 'video_url': None, 'description': 'The Federal Board of Intermediate and Secondary Education FBISE has announced the results of HSSC-I and II exams 2023 today (Wednesday).', 'content': 'The Federal Board of Intermediate and
Secondary Education FBISE has announced the results of HSSC-I and II exams 2023 today (Wednesday). The Higher Secondary School Certificate candidates can check the results here at The results will be available on the FBISE website and will also be available through SMS unified code 5050. The candidates will be required to send SMS in the following format; FB(roll number). The federal board made the announcement on its social media platforms, stating that the results will be available to students at 10: 30 am. It said Federal Minister for Education
& Professional Training Madad Ali Sindhi will be chief guest at the ceremony regarding the announcement of the results.', 'pubDate': '2023-08-23 06: 07: 59', 'image_url': 'https: //en.dailypakistan.com.pk/digital_images/large/2023-08-23/fbise-hssc-part-1-result-check-federal-board-inter-results-2023-here-1692764121-7579.jpg', 'source_id': 'dailypakistanen', 'source_priority': 97265, 'country': ['pakistan'], 'category': ['top'], 'language': 'english'}, {'title': 'GCSE Results Day 2023: Where students get free food to celebrate - including Nando’s & TGI Fridays', 'link': 'https://www.derryjournal.com/lifestyle/gcse-results-day-2023-where-students-get-free-food-to-celebrate-including-nandos-tgi-fridays-4265199', 'keywords': ['Lifestyle'], 'creator': ['Chelsie Sewell'], 'video_url': None, 'description': 'GCSE Results students will be able to get free food at some
major restaurant chains on results day', 'content': 'GCSE Results Day is looming this week, but to ease the stress why not plan a post-results day celebration? With many food chains and restaurants offering free meals for GCSE Results students, you can go out to celebrate without spending a penny. GCSE students will receive their results on August 24, after two years of grafting. Whether you’re planning to head off to university, start an apprenticeship or make your way into the world of work, food-chain favourites such as Nandos and Frankie and Benny’s are all school leavers celebrating this week. We have rounded up some of the restaurants offering free meals for GCSE students on results day. Nando’s
are offering students a free ¼ Chicken or Starter when they show their student
ID and results at the till on results day. To qualify you need to spend £7 or more and order at the till to Eat-in or Walk-in Collect at one of their restaurants. This will also apply to the GCSE Results Day on Thursday, August 24. For GCSE Result Days Frankie & Benny’s is offering students who show their exam results to a member of staff a free pizza and Coke. The deal offers students a free Margarita Pizza (Vegan & Gluten Free Available) and a regular Coke (Coke Zero, Regular Coke, Diet Coke). The free meal offer is available on the exam results day only and additional pizza toppings can be bought from the menu. Bill’s restaurant chain is giving students a free dessert when a main course is ordered on GCSE Results Day. In a statement, Bill’s said: “To receive a free dessert, all that is needed is to bring along your student ID & proof of results, purchase any main and we’ll serve you a delicious free dessert! Results day feelings of relief never tasted so good…” Chiquito is offering a free portion of Garlic Tortilla Bread and a regular Coke to students who show their exam results to a staff member. Chiquito Marketing Director, Andreia Harwood, said: “We recognise that the cost of living crisis is hard on us all but we wanted to make sure our
hard-working students can celebrate their exam results day on us. “This summer
has all been about our customers still being able to enjoy great meals out with the family and friends.” Wildwood is giving away a free garlic rosemary bread
or a classic margherita or spaghetti pomodoro, with a minimum spend of £7 per person. This is valid only with proof of age via ID shown upon request along with valid exam results. The offer will be available all day on August 24 for GCSE students. On August 24, students can get 23% off their food bill but they will need to join the Stripes Rewards loyalty programme to qualify. Students can get 30% off their food bill on August 24. You will need to input your email at their website here to get a code to redeem this offer. Proof of receiving results for GCSE must be shown to your server when you arrive at the restaurant. At least one adult main must be purchased to receive the offer and it is not valid on delivery, take away or click and collect.', 'pubDate': '2023-08-23 05: 51: 19', 'image_url': 'https: //www.derryjournal.com/webimg/b25lY21zOmFhZmIyNmExLWRiM2QtNDc3YS04YzcxLTA3OTc3YjIzZDkyNDoxZGVhOTE2Mi05YzRmLTRlZGEtYTRlZi0zYzIyMGM1YTNiN2I=.jpg?width=1200&auto=webp', 'source_id': 'derryjournal', 'source_priority': 402321, 'country': ['ireland'], 'category': ['top'], 'language': 'english'}, {'title': 'GCSE Results Day 2023: Where students get free food to celebrate - including Nando’s & TGI Fridays', 'link': 'https://www.thescarboroughnews.co.uk/lifestyle/gcse-results-day-2023-where-students-get-free-food-to-celebrate-including-nandos-tgi-fridays-4265199', 'keywords': ['Lifestyle'], 'creator': ['Chelsie Sewell'], 'video_url': None, 'description': 'GCSE Results students will be able
to get free food at some major restaurant chains on results day', 'content': "GCSE Results Day is looming this week, but to ease the stress why not plan a post-results day celebration? With many food chains and restaurants offering free
meals for GCSE Results students, you can go out to celebrate without spending a penny. GCSE students will receive their results on August 24, after two years
of grafting. Whether you’re planning to head off to university, start an apprenticeship or make your way into the world of work, food-chain favourites such as Nandos and Frankie and Benny’s are all school leavers celebrating this week. Advertisement Hide Ad Advertisement Hide Ad We have rounded up some of the restaurants offering free meals for GCSE students on results day. GCSE Results free
food Most Popular 1 Inside this Scarborough home that's got huge family appeal
2 See inside this appealing Scarborough village home with a self-contained annexe Nando’s Nando’s are offering students a free ¼ Chicken or Starter when they
show their student ID and results at the till on results day. To qualify you need to spend £7 or more and order at the till to Eat-in or Walk-in Collect at one of their restaurants. This will also apply to the GCSE Results Day on Thursday, August 24. Frankie and Benny’s For GCSE Result Days Frankie & Benny’s is offering students who show their exam results to a member of staff a free pizza and Coke. The deal offers students a free Margarita Pizza (Vegan & Gluten Free Available) and a regular Coke (Coke Zero, Regular Coke, Diet Coke). Advertisement Hide Ad Advertisement Hide Ad The free meal offer is available on the exam results day only and additional pizza toppings can be bought from the menu. Bill’s Bill’s restaurant chain is giving students a free dessert when a main course is ordered on GCSE Results Day. In a statement, Bill’s said: “To receive a free
dessert, all that is needed is to bring along your student ID & proof of results, purchase any main and we’ll serve you a delicious free dessert! Results day
feelings of relief never tasted so good…” Chiquito Chiquito is offering a free
portion of Garlic Tortilla Bread and a regular Coke to students who show their
exam results to a staff member. Advertisement Hide Ad Advertisement Hide Ad Chiquito Marketing Director, Andreia Harwood, said: “We recognise that the cost of living crisis is hard on us all but we wanted to make sure our hard-working students can celebrate their exam results day on us. “This summer has all been about our customers still being able to enjoy great meals out with the family and friends.” Nando's will be opening in Burnley town centre later this summer. (Photo for illustrative purposes only) Wildwood Wildwood is giving away a free garlic rosemary bread or a classic margherita or spaghetti pomodoro, with a minimum spend of £7 per person. This is valid only with proof of age via ID shown upon request along with valid exam results. The offer will be available all day on August 24 for GCSE students. TGI Fridays Advertisement Hide Ad Advertisement
Hide Ad On August 24, students can get 23% off their food bill but they will need to join the Stripes Rewards loyalty programme to qualify. Students can get 30% off their food bill on August 24. You will need to input your email at their website here to get a code to redeem this offer. Proof of receiving results for GCSE must be shown to your server when you arrive at the restaurant. At least one adult main must be purchased to receive the offer and it is not valid on delivery, take away or click and collect. Related topics: Students Food Restaurants Work", 'pubDate': '2023-08-23 05:51:19', 'image_url': 'https://www.thescarboroughnews.co.uk/webimg/b25lY21zOmFhZmIyNmExLWRiM2QtNDc3YS04YzcxLTA3OTc3YjIzZDkyNDoxZGVhOTE2Mi05YzRmLTRlZGEtYTRlZi0zYzIyMGM1YTNiN2I=.jpg?width=1200&auto=webp', 'source_id': 'thescarboroughnews', 'source_priority': 2093250, 'country': ['united kingdom'], 'category': ['entertainment', 'business'], 'language': 'english'}], 'nextPage': '1692769879353445922'}